In [1]:
import pandas as pd

## Q1: Create a Series with indexes = 1, 2, 3 and has three names.

In [2]:
names = pd.Series(['Abdulrahman','Mohammed','Nasser'],index=[1,2,3])
names

1    Abdulrahman
2       Mohammed
3         Nasser
dtype: object

## Q2: Change indexes to 11, 12, 13.

In [3]:
names.index = [11,12,13]
names

11    Abdulrahman
12       Mohammed
13         Nasser
dtype: object

## Q3: Retrieve First and second elements.

In [4]:
names[0:2]

11    Abdulrahman
12       Mohammed
dtype: object

## Q4: Add duplicate elements, then remove the duplication.

In [5]:
names1 = pd.Series(['Abdulrahman','Mohammed','Nasser'])
names = names.append(names1)
print('Before : \n',names,'\n')
print('After : \n',names.drop_duplicates())

Before :
 11    Abdulrahman
12       Mohammed
13         Nasser
0     Abdulrahman
1        Mohammed
2          Nasser
dtype: object

After :
 11    Abdulrahman
12       Mohammed
13         Nasser
dtype: object

C:\Users\albgm\AppData\Local\Temp\ipykernel_18988\3666665179.py:2: FutureWarning: The series.append method is deprecated and will be removed from pandas in a future version. Use pandas.concat instead.
  names = names.append(names1)

## Q5: Create a Students DataFrame has three columns (ID, Name, GPA).

In [9]:
Students = pd.DataFrame(columns=['ID','Name','GPA'])
Students

Empty DataFrame
Columns: [ID, Name, GPA]
Index: []

## Q6: Read educ_figdp_1_Data.csv file and print the head.

In [11]:
file_read = pd.read_csv("educ_figdp_1_Data.csv")
file_read.head()

,TIME,GEO,INDIC_ED,Value,Flag and Footnotes
0,2000,European Union (28 countries),Total public expenditure on education as % of ...,:,NaN
1,2001,European Union (28 countries),Total public expenditure on education as % of ...,:,NaN
2,2002,European Union (28 countries),Total public expenditure on education as % of ...,5.00,e
3,2003,European Union (28 countries),Total public expenditure on education as % of ...,5.03,e
4,2004,European Union (28 countries),Total public expenditure on education as % of ...,4.95,e

## Q7: Give an example shows the difference between loc and slicing?
**Note:**
- loc use the index labels as references.
- slice use the position as references.

In [8]:
print('using slicing : \n',names[0:2],'\n') # to retrieve the first two elements using slicing [Exclusive]
print('using loc: \n',names.loc[0:1],'\n') # to retrieve the first two elements using slicing [Inclusive]

using slicing :
 11    Abdulrahman
12       Mohammed
dtype: object

using loc:
 0    Abdulrahman
1       Mohammed
dtype: object